# XVec Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointOnPlane..::..XVec Property
PointOnPlane Class See Also
---
The X-coordinate vector of the point, in the plane's coordinate system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UV XVec { get; set; }
```

Visual Basic
---
```text
Public Property XVec As UV
	Get
	Set
```

Visual C++
---
```text
public:
property UV^ XVec {
	UV^ get ();
	void set (UV^ value);
}
```

# See Also
PointOnPlane Class
Autodesk.Revit.DB Namespace